striveFar/qmk_firmware/platforms/nrf52/_pin_defs.h
/* Copyright 2022 JasonRen(biu)
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#pragma once

#define GPIO(port, pin) ((port << 5) | pin)

#define P0_0 GPIO(0,0)
#define P0_1 GPIO(0,1)
#define P0_2 GPIO(0,2)
#define P0_3 GPIO(0,3)
#define P0_4 GPIO(0,4)
#define P0_5 GPIO(0,5)
#define P0_6 GPIO(0,6)
#define P0_7 GPIO(0,7)
#define P0_8 GPIO(0,8)
#define P0_9 GPIO(0,9)
#define P0_10 GPIO(0,10)
#define P0_11 GPIO(0,11)
#define P0_12 GPIO(0,12)
#define P0_13 GPIO(0,13)
#define P0_14 GPIO(0,14)
#define P0_15 GPIO(0,15)
#define P0_16 GPIO(0,16)
#define P0_17 GPIO(0,17)
#define P0_18 GPIO(0,18)
#define P0_19 GPIO(0,19)
#define P0_20 GPIO(0,20)
#define P0_21 GPIO(0,21)
#define P0_22 GPIO(0,22)
#define P0_23 GPIO(0,23)
#define P0_24 GPIO(0,24)
#define P0_25 GPIO(0,25)
#define P0_26 GPIO(0,26)
#define P0_27 GPIO(0,27)
#define P0_28 GPIO(0,28)
#define P0_29 GPIO(0,29)
#define P0_30 GPIO(0,30)
#define P0_31 GPIO(0,31)
#define P1_0 GPIO(1,0)
#define P1_1 GPIO(1,1)
#define P1_2 GPIO(1,2)
#define P1_3 GPIO(1,3)
#define P1_4 GPIO(1,4)
#define P1_5 GPIO(1,5)
#define P1_6 GPIO(1,6)
#define P1_7 GPIO(1,7)

